In [2]:
# !pip install pandas
import pandas as pd

In [7]:
info = {
    "Name": ["Sanju", "Ayush", "Patel", "Vinay"],
    "CGPA": [9.5, 7.5, 8.5, 9.2]
}

df = pd.DataFrame(info)

print(df)

    Name  CGPA
0  Sanju   9.5
1  Ayush   7.5
2  Patel   8.5
3  Vinay   9.2

In [8]:
df

    Name  CGPA
0  Sanju   9.5
1  Ayush   7.5
2  Patel   8.5
3  Vinay   9.2